Repository: Mrmohanak/occ
Catalog: po/*.po
Languages: ar

source: Unable to remove samples icon.
ar: غير قادر على إزالة أيقونة العينات.

source: Sound settings and tools
ar: إعدادات الصوت وأدواته

source: Warning: using headphone at high volume may harm your ears.
ar: تحذير: استخدام سماعة الرأس على صوت مرتفع تؤذي أذنيك.

source: volume up!
ar: رفع شدة الصوت!

source: Simple gnome mixer
ar: مازج الصوت البسيط في غنوم

source: Advanced mixer
ar: مازج الصوت المتقدم

source: You may need to use HDA fix from advanced options below.
ar: قد يلزمك استعمال إصلاح HDA من الخيارات المتقدمة أدناه.

source: Advanced options
ar: خيارات متقدمة

source: HDA fix for Acer Aspire 8920G:
ar: إصلاح HDA لجهاز Acer Aspire 8920G:

source: apply now
ar: تطبيق الآن

source: enable at boot
ar: التطبيق عند الإقلاع

source: remove from boot
ar: حذفها من الإقلاع

source: By default sound works in time-based scheduling which consumes less power and CPU load. But some drivers have a problem with time mode. If you experience skipping in sound you may disable this feature.
ar: يأتي الصوت تلقائيا بطور الجدولة الزمنية فهو يستهلك طاقة أقل ولا يشغل المعالج. بعض التعريفات بها مشاكل مع الطور الزمني. إن واجهت قفزات تخطي في الصوت يمكنك تعطيل هذه الميزة.

source: Time-based scheduling
ar: الجدولة الزمنية

source: If you have disabled time-based scheduling and the sound still skips, try setting realtime scheduling.
ar: إن قمت بتعطيل الجدولة الزمنية وبقي الصوت يقفز جرب تفعيل الوقت الحقيقي.

source: Realtime scheduling
ar: الجدولة في الوقت الحقيقي

source: Done. New settings will take effect on next boot.
ar: تم. ستأخذ الإعدادات الجديدة مفعولها عند إعادة التشغيل.

source: Are you sure you want to disable an already enabled hda fix ?
ar: هل أنت متأكد من رغبتك في تعطيل ما كنت قد فعّلته من إصلاح hda ?

source: System Language:
ar: لغة النظام:

source: Select the default system language
ar: اختر لغة النظام التلقائية

source: Other Language
ar: لغة أخرى

source: Display settings and tools
ar: إعدادات العرض وأدواته

source: glxgears Result:
ar: نتيجة اختبار المسننات

source: N/A
ar: بلا

source: check KMS
ar: فحص حالة KMS

source: disable KMS
ar: تعطيل KMS

source: enable KMS
ar: تفعيل KMS

source: Configure Display
ar: إعداد العرض

source: use EXA acceleration
ar: استخدام تسريع EXA

source: use XAA acceleration
ar: استخدام تسريع XAA

source: use default acceleration
ar: استخدام التسريع التلقائي

source: use software cursor
ar: استخدام مؤشر برمجي

source: use default cursor
ar: استخدام المؤشر التلقائي

source: Disable DFS Acceleration
ar: تعطيل تسريع DFS

source: default DFS settings
ar: إعدادات DFS التلقائية

source: Install proprietary nVidia drivers:
ar: تثبيت تعريفات nVidia المملوكة:

source: Enable proprietary drivers
ar: تفعيل التعريفات المملوكة

source: nVidia Settings
ar: إعدادات nVidia

source: proprietary nVidia drivers [%s] already installed.
ar: تعريفات nVidia المملوكة [%s] مثبتة مسبقا.

source: KMS is enabled for all kernels. Note: You may need to remake grub config file.
ar: أصبح الخيار KMS مفعّلا لكل الأنوية. تنبيه: قد تكون فى حاجة لإعادة توليد ملف إعداد Grub.

source: KMS is enabled for some kernels, and disabled for others.
ar: الخيار KMS مفعّل لبعض الأنوية و معطل في بعضها الآخر.

source: KMS is disabled for all kernels. Note: You may need to remake grub config file.
ar: أصبح الخيار KMS معطّلا لكل الأنوية. تنبيه: قد تكون فى حاجة لإعادة توليد ملف إعداد Grub.

source: KMS is now disabled for all kernels.
ar: أصبح الخيار KMS معطّلا لكل الأنوية.

source: KMS is now enabled for all kernels.
ar: أصبح الخيار KMS مفعّلا لكل الأنوية.

source: Your VGA driver supports direct rendering. Before you enable special effects please perform 5 second glxgears speed test.
ar: تعريف بطاقة العرض عندك يدعم تسريع DRI. قبل تفعيل المؤثرات البصرية الخاصة فضلا قم بعمل اختبار المسننات لمدة 5 ثوان.

source: Your VGA driver does <span color='red'><b>not</b></span> support direct rendering. You should <b>not</b> enable special effects till you solve this problem. You may want to check how slow is your VGA card by performing 5 second glxgears speed test.
ar: تعريف بطاقة العرض <span color='red'><b>لا</b></span> يدعم DRI. يجب أن <b>لا</b> تفعل المؤثرات الخاصة حتى تحل هذه المشكلة. قد ترغب بإجراء اختبار المسننات لمدة 5 ثوان لتدرك مدى بطء البطاقة.

source: If you got more than <b>500 FPS</b> then you may use special effects efficiently.
ar: إن حصلت على أكثر من <b>500 إطار بالثانية</b> عندها يمكنك تفعيل المؤثرات البصرية بكل أريحية.

source: Your VGA card performance is good. you may enjoy special effects.
ar: أداء بطاقة العرض عندك جيد. تمتع بالمؤثرات البصرية.

source: Although your VGA card driver supports direct rendering, it has poor performance.
ar: مع أن بطاقة العرض تدعم DRI إلا أن أداءها سيء.

source: we don't recommend enabling special effects until you fix this issue by one or more of the advanced options below.
ar: لا ننصح بتفعيل المؤثرات الخاصة حتى تحل هذه المشكلة بواحدة أو أكثر من الخيارات المتقدمة المبينة أدناه.

source: You might enhance your VGA performance by trying one or more of the advanced options below.
ar: قد يتحسن أداء بطاقة العرض بتجربة واحدة أو أكثر من الخيارات المتقدمة أدناه.

source: nVidia Proprietary drivers are not loaded. You may enhance graphics performance by installing nvidia proprietary drivers.
ar: تعريفات nVidia المملوكة غير محملة. قد يتحسن أداء العرض بتثبيتها.

source: Some cards have problems with KMS, try to disable KMS and reboot.
ar: بعض البطاقات تواجه مشكلة مع KMS, جرب تعطيل KMS ثم إعادة التشغيل.

source: wait 5 seconds
ar: انتظر 5 ثوان

source: FPS
ar: إطار بالثانية

source: Fallback X procedures:
ar: إجراءات إصلاح إكس:

source: This is an advanced tool that should <b>NOT</b> be used in normal cases. If you tried other tools and it fails you may use this tool.
ar: هذه أداة متقدمة يجب أن <b>لا</b> تستخدم في الحالات العادية. إن فشلت الأدوات الأخرى قد تفيدك هذه الأداة.

source: Show Advanced options
ar: إظهار الخيارات المتقدمة

source: initrd generation
ar: توليد initrd

source: initrd file could contain old modules that conflict some proprietary drivers. You may want to generate a new initrd file.
ar: قد يحتوي ملف initrd على وحدات تعريف قديمة تتضارب مع التعريفات المملوكة. قد ترغب في توليد ملف جديد.

source: Generate initrd
ar: توليد initrd

source: Xorg.conf creation tool
ar: أداة إنشاء ملف إعداد إكس xorg.conf

source: Xorg.conf is the file that controls X server which is the base of the graphical environment. This tool will overwrite xorg.conf with a new one that is not based on your working one.
ar: ملف xorg.conf هو الملف الذي يتحكم في خادم إكس الذي هو أساس البيئة الرسومية. هذه الأداة ستطمس ملف xorg.conf العامل حاليا وتنشئ واحد جديد من الصفر.

source: Driver:
ar: التعريف:

source: usually a single lower case word like: %s
ar: عادة كلمة واحدة من حروف صغيرة مثل: %s

source: Enable Composite extension
ar: تفعيل إمتداد composite

source: This extention is needed by special effects but could case problems in rare cases.
ar: تفعيل المؤثرات الخاصة يحتاج هذه الإضافة لكنها قد تتسبب في مشاكل في بعض الحالات النادرة.

source: Enable AIGLX
ar: تفعيل AIGLX

source: Enable Accelerated indirect rendering.
ar: تفعيل التسريع غير المباشر Accelerated indirect rendering.

source: Vertical Refresh Rate:
ar: معدل التحديث الرأسى :

source: auto
ar: تلقائي

source: manual:
ar: يدوي:

source: a value of 85Hz would be nicer on your eyes, lower values like 60Hz would work with LCD or old CRT monitors.
ar: قيم عالية مثل 85 هيرتز تكون لطيفة على العين، بالمقابل قيم منخفضة مثل 60 هيرتز تصلح لشاشات LCD أو CRT القديمة

source: HD Resolutions:
ar: استبانة عالية HD:

source: LCD Wide Resolutions:
ar: استبانات LCD Wide العريضة:

source: Normal Resolutions:
ar: استبانة طبيعية:

source: Delete xorg.conf
ar: حذف ملف xorg.conf

source: This will make X use default settings.
ar: هذا سيعيد إكس للإعدادات التلقائية.

source: Do you like to remove xorg.conf file to use default settings?
ar: هل ترغب في حذف ملف xorg.conf للعودة للإعدادات التلقائية؟

source: Done. Changes will take effect when you login next time.
ar: تم. ستأخذ الإعدادات الجديدة مفعولها عند إعادة الولوج.

source: driver should be one word
ar: التعريف يجب أن يكون كلمة واحدة

source: driver should be lower case
ar: يجب أن يتكون التعريف من حروف صغيرة

source: Are you sure you want to overwrite your currently working xorg.conf file and generate a new one ?
ar: هل أنت متأكد من رغبتك في طمس ملف الإعدادات xorg.cong العامل حاليا لتوليد واحد جديد؟

source: Some proprietary require rebuild initrd. Would you like to do that?
ar: بعض التعريفات المملوكة تتطلب إعادة إنشاء initrd. ؟هل ترغب بعمل ذلك

source: Done. Changes will take effect when you reboot.
ar: تم. ستأخذ الإعدادات الجديدة مفعولها عند إعادة التشغيل.
