Repository: Mrmohanak/occ
Catalog: po/*.po
Languages: ar

source: Ojuba Control Center
ar: مركز تحكم أعجوبة

source: Control your preferences and settings
ar: تحكم في التفضيلات والإعدادات

source: Desktop
ar: سطح المكتب

source: generic desktop preferences and customization
ar: تفضيلات سطح المكتب العامة وتخصيصاته

source: GNOME Desktop
ar: سطح مكتب غنوم

source: GNOME desktop preferences and customization
ar: تفضيلات سطح مكتب غنوم وتخصيصاته

source: Installer
ar: تثبيت

source: Install applications or setup ojuba
ar: تثبيت تطبيقات أو تنصيب أعجوبة

source: Hardware
ar: عتاد

source: Configure hardware
ar: إعداد العتاد

source: Network
ar: الشبكة

source: Network related options and settings
ar: خيارات متعلقة بالشبكة وإعداداتها

source: Boot and Kernel
ar: الإقلاع والنواة

source: This setting Unavailable
ar: هذه الإعدادات غير متوفرة

source: Reset
ar: استعادة

source: Not installed
ar: غير مثبت

source: Refresh
ar: تحديث

source: Could not create folder
ar: غير قادر على إنشاء المجلد

source: Reset all
ar: استعادة الكل

source: Are you sure?
ar: هل أنت متأكد

source: Adjust desktop fonts
ar: ضبط خطوط سطح المكتب

source: Back to Main
ar: عودة للقائمة الرئيسية

source: About Ojuba Control Center
ar: عن مركز تحكم أعجوبة

source: File [%s] not found.
ar: الملف [%s] غير موجود.

source: not available
ar: غير متوفر

source: All image files
ar: جميع ملفات الصور

source: Select directory
ar: إختر الدليل

source: Site Blocking
ar: حظر المواقع

source: Filter sites with explicit contents
ar: حجب المواقع ذات المحتويات الفاضحة

source: Block ads and spyware sites
ar: حظر مواقع الإعلانات والتجسس وانتهاك الخصوصية

source: View blocked sites list
ar: عرض المواقع المحظورة

source: connect to ojuba.org to get the updated list
ar: اتصل بموقع أعجوبة للحصول على قائمة محدّثة

source: Block sites in your personal black list
ar: حظر المواقع الموجودة في قائمتك السوداء الخاصة

source: Personal black list
ar: القائمة السوداء الخاصة

source: Unable to fetch black list.
ar: لا يمكن الحصول على القائمة السوداء الخاصة

source: Done. You may need to restart your browser.
ar: تم. قد يتوجب عليك إعادة تشغيل المتصفح.

source: Boot options
ar: خيارات الإقلاع

source: Default
ar: تلقائي

source: Graphical Boot:
ar: الإقلاع الرسومي:

source: Done!
ar: تم.

source: Graphical Login Manager
ar: مدير الولوج الرسومي

source: Display Manager is the application that allow you to log into your desktop. It's the application that might ask you to authenticate with your username and password
ar: مدير الولوج الرسومي هو البرنامج الذي قد يسألك عن اسم المستخدم وكلمة السر للقيام بعملية المواثقة ثم السماح لك بالدخول إلى سطح المكتب

source: Available display managers:
ar: المتوفرة

source: save change
ar: حفظ التغييرات

source: Enable Automatic Login as this user
ar: تفعيل الولوج التلقائي إلى حساب المستخدم الحالي

source: Disable Automatic Login
ar: تعطيل الولوج التلقائي

source: Display manager is now set to %s
ar: تم تحديد مدير الولوج الرسومي ليكون %s

source: Unable to set display managed.
ar: غير قادر على اختيار مدير الولوج.

source: could not set automatic login in %s
ar: غير قادر على إعداد الولوج التلقائي في %s

source: Automatic login as %s was set in %s
ar: تم تفعيل الولوج التلقائي إلى حساب %s في %s

source: could not set automatic login
ar: غير قادر على إعداد الولوج التلقائي

source: could not disable automatic login
ar: غير قادر على تعطيل الولوج التلقائي

source: could not disable automatic login in %s
ar: غير قادر على تعطيل الولوج التلقائي في %s

source: automatic login is now disabled
ar: الولوج التلقائي أصبح الآن معطلا

source: Favorite Packages
ar: الحزم المفضلة

source: Those are some selected software packages. If you got packages DVD, you may like to enable it before installing the packages.
ar: هذه حزم برمجية منتقاة. إن كنت تمتلك قرص DVD يحتوي على حزم، قد ترغب في تفعيله قبل تثبيت أي من هذه الحزم.

source: Desktop:
ar: سطح المكتب:

source: extra screensavers
ar: حافظات شاشة إضافية

source: Internet:
ar: إنترنت:

source: Mobile related:
ar: متعلقة بالجوال :

source: Multimedia and Grpahics:
ar: الوسائط المتعددة والرسوميات :

source: Games:
ar: ألعاب:

source: Secret Maryo Chronicles
ar: أسرار مغامرات ماريو

source: Development:
ar: التطوير:

source: Servers:
ar: الخوادم:

source: web server collection
ar: مجموعة حزم خادم الويب

source: collection of LAMP web server related packages
ar: حزم منتقاة متعلقة بخادم الويب LAMP

source: ftp server
ar: خادم ftp

source: collection of ftp server related packages
ar: حزم منتقاة متعلقة بخادم ftp

source: tomcat collection
ar: مجموعة tomcat :

source: collection of tomcat related packages
ar: مجموعة الحزم المتعلقة بـ tomcat

source: Engineering:
ar: الهندسة:

source: Circuits collection
ar: حزم الدوائر الإلكترونية

source: Circuits collection already installed
ar: مجموعة حزم الدوائر الإلكترونية مثبتة مسبقا

source: already installed
ar: الحزم مثبتة مسبقا

source: Installing fonts:
ar: تثبيت الخطوط

source: Open your personal fonts folder and manage your fonts there. Just drag and drop or copy and past font files there.
ar: افتح مجلد الخطوط الشخصي حيث يمكنك إدارة ملفات الخطوط. كل ما عليك هو سحب وإفلات ملفات الخطوط أو نسخها ولصقها.

source: Personal fonts folder
ar: مجلد الخطوط الشخصي

source: Import fonts from another installed OS
ar: استيراد الخطوط من نظام تشغيل آخر مثبت على هذا الجهاز.

source: Are you sure you want to search and install fonts ? Make sure that the partitions are mounted and you have a license to use the fonts.
ar: هل أنت متأكد أنك تريد البحث عن الخطوط وتثبيتها ؟ تأكد من أن أقسام القرص الصلب مضمومة وأنك تمتلك رخصة لاستعمال تلك الخطوط.

source: There are %i fonts found, only %i could be important to you. Do you want to install all the fonts?
ar: هناك %i خطا، قد لا تكون مهتما إلا ب %i منها. هل تريد تثبيت كل الخطوط؟

source: Done. %d font were installed.
ar: تم تثبيت خطوط بعدد %d.

source: Gnome Control Center
ar: مركز تحكم غنوم

source: GNOME Control Center
ar: مركز تحكم غنوم

source: GNOME Menu Editor
ar: محرر قوائم غنوم

source: Desktop Fonts
ar: خطوط سطح المكتب

source: Text scaling factor
ar: حجم النص

source: Default font
ar: الخط التلقائى

source: Document font
ar: خط المستندات

source: Monospace font
ar: خط Monospace

source: Hinting
ar: التلميحات

source: Antialiasing
ar: الحواف

source: Window title
ar: عنوان النافذة

source: Desktop Icons
ar: أيقونات سطح المكتب

source: Select the icons you want to be visible on desktop
ar: اختر الأيقونات التي تريدها أن تظهر على سطح المكتب

source: Show desktop icons
ar: إظهار أيقونات سطح المكتب

source: Computer
ar: الحاسوب

source: Home
ar: البيت

source: Trash
ar: المهملات

source: Mounted volumes
ar: الأقراص المضمومة

source: Shell Interface
ar: إعداد واجهة الصدفة

source: Adjust interface settings
ar: ضبط إعدادات الواجهة

source: Show seconds in clock
ar: إظهار الثوانى مع الساعة

source: Show date in clock
ar: إظهار التاريخ مع الساعة

source: Menus have icons
ar: إظهار رموز القوائم

source: Buttons have icons
ar: إظهار رموز الأزرار

source: Clock format
ar: تنسيق الوقت

source: Shell theme
ar: سمة الصدفة

source: Add Shell theme
ar: أضف سمة للصدفة

source: GTK+ theme
ar: سمة GTK+

source: Add GTK+ theme
ar: أضف سمة GTK+

source: Icon theme
ar: سمة الأيقونات

source: Add icons theme
ar: أضف سمة للأيقونات

source: Cursor theme
ar: سمة المؤشرات

source: Add cursor theme
ar: أضف سمة المؤشرات

source: Windows theme
ar: سمة النوافذ

source: Add Windows theme
ar: أضف سمة للنوافذ

source: This option requires shell reload
ar: هذا الخيار يحتاج إعادة تشغيل الصدفة

source: Power settings
ar: إعدادات الطاقة

source: Adjust power settings
ar: ضبط إعدادات الطاقة

source: Power button
ar: عند ضغط زر الطاقة

source: Hibernate button
ar: عند ضغط زر الإثبات

source: Sleep button
ar: عند ضغط زر الخمول

source: Suspend button
ar: عند ضغط زر التعليق

source: Critical battery action
ar: وضع البطارية الحرج

source: Laptop lid close action on AC
ar: إغلاق غطاء الكمبيوتر المحمول أثناء وصل الطاقة

source: Laptop lid close action on battery
ar: إغلاق غطاء الكمبيوتر المحمول مع البطارية

source: Sleep inactive type on AC
ar: الخمول فى حالة إنعدام النشاط أثناء وصل الطاقة

source: Sleep inactive type on power
ar: الخمول فى حالة إنعدام النشاط مع البطارية

source: Gnome shell extensions
ar: إضافات غنوم شل

source: Personal shell extensions folder
ar: مجلد إضافات غنوم شل الشخصي

source: Adjust windows settings
ar: ضبط إعدادات النوافذ

source: Action on title bar double-click
ar: عمل النقر المزدوج على شريط العنوان

source: Action on title bar middle-click
ar: عمل النقر الأوسط على شريط العنوان

source: Action on title bar right-click
ar: عمل النقر الأيمن على شريط العنوان

source: Window focus mode
ar: طور تبئير النوافذ

source: Windows button layout
ar: توزيع أزرار النوافذ

source: Require Gnome-Shell Restart
ar: أنت بحاجة لإعادة تشغيل غنوم شل

source: Grub2 settings:
ar: إعدادات محمل الإقلاع Grub2

source: This section will help you to change grub2 settings
ar: فى هذا القسم يمكن التحكم فى إعدادات محمل الإقلاع Grub2

source: Grub2 not isntalled!
ar: Grub2 غير مثبت

source: Time out
ar: المهلة

source: Seconds
ar: ثوان

source: Kernel options
ar: خيارات النواة

source: Enabel recovery option
ar: تفعيل خيار الإنقاذ

source: Enabel Grub2 theme
ar: تفعيل سمات محمل الإقلاع Grub2

source: Grub2 Theme:
ar: سمات محمل الإقلاع Grub2

source: This section will help you to change grub2 Font and background (theme).
ar: فى هذا القسم يمكن التحكم فى خط وخلفية قائمة محمل الإقلاع (السمة )

source: Background
ar: الخلفية

source: Chang background
ar: تغيير الخلفية

source: Set GFXMODE
ar: إجعل قيمة GFXMODE

source: Enable this option if you have boot troubles If your monitor got out sync or turned off, While grub2 menu Press enter to continue booting, And enable this option.
ar: فعل هذا الخيار عند مواجهة مشاكل أثناء الإقلاع إذا واجهت شاشة سوداء عوضاً عن قائمة محمل الإقلاع إضغط مفتاح الإدخال من لوحة المفاتيح ؛ لاستكمال الإقلاع ، ثم فعل هذا الخيار لحل المشكلة

source: Font name
ar: الخط

source: Apply
ar: تطبيق

source: Choose boot background
ar: إختر خلفية محمل الإقلاع

source: Error: Can not use this font!
ar: خطأ : لا يمكن استخدام هذا الخط!

source: Are you sure you want to apply changes?
ar: هل انت متأكد أنك ترغب في تطبيق الإعدادات ؟

source: Error!
ar: خطأ!

source: Hardware Information
ar: معلومات عن العتاد

source: Details
ar: تفاصيل

source: Update PCI ID database
ar: تحديث قاعدة بيانات معرّفات PCI

source: unexpected return code, possible an error had occurred.
ar: كود غير متوقع، غالبا حدث خطأ.

source: Done.
ar: تم.

source: CPU
ar: المعالج

source: Memory
ar: الذاكرة

source: VGA
ar: بطاقة العرض VGA

source: Sound card
ar: بطاقة الصوت

source: USB
ar: الناقل المتسلسل العالمي USB

source: System Kernel:
ar: النواة:

source: Keep only one kernel
ar: الاحتفاظ بنواة واحدة

source: A typical kernel can deal with up to 4GB of RAM. PAE kernels can deal with much much more than that.
ar: النواة التقليدية تدعم حتى 4 غيغابايت من الذاكرة رام. الأنوية بتقنية PAE تستطيع التعامل مع كميات أكبر بكثير من ذلك.

source: Install PAE kernel
ar: تثبيت نواة PAE

source: PAE kernel is installed
ar: نواة PAE مثبتة

source: kernel which supports larger memory
ar: نواة تدعم حجوم أكبر من الذاكرة

source: There are two types of drivers: <i>kmods</i> and <i><b>a</b>kmods</i>. Although <b>akmod</b> drivers requires: more disk space for the development dependencies, they will automatically generate drivers for newly-installed kernels without breaking the dependency. We strongly recommend that you use <b>akmod</b>.
ar: هناك نوعان من وحدات التعريفات: <i>kmods</i> و <i><b>a</b>kmods</i>. مع أن تعريفات <b>akmod</b> تتطلب مساحة أكبر لاعتمادها على الحزم التطويرية. إلا أنها تولد التعريفات الخاصة بالأنوية الجديدة تلقائيا دون كسر الاعتمادية. ننصحك بشدة أن تستخدم تعريفات <b>akmod</b>.

source: Install corresponding akmods for installed kmods
ar: تثبيت تعريفات akmods المقابلة لكل تعريفات kmods المثبتة حاليا

source: Developers need kernel documentation and kernel development tools
ar: المطورون قد يرغبون بالحصول على وثائق النواة وأدواتها التطويرية

source: Install kernel documentation
ar: تثبيت وثائق النواة

source: kernel documentation is already installed
ar: وثائق النواة مثبتة مسبقا

source: Kernel documentation
ar: وثائق النواة

source: Install kernel development tools
ar: تثبيت أدوات تطوير النواة

source: kernel development package is already installed
ar: حزمة تطوير النواة مثبتة مسبقا

source: needed for building kernel module
ar: تلزم لمن يبني وحدات للنواة

source: all needed akmods are already installed.
ar: كل حزم kmods اللازمة مثبتة مسبقا

source: Fixing legacy fonts:
ar: إصلاح الخطوط القديمة:

source: Some legacy fonts do not use any standard encoding. This tool helps you to convert them to standard openType fonts. Drag and drop the files into the list then click convert.
ar: بعض الخطوط القديمة لا تستخدم ترميزا قياسيا. هذه الأداة تساعدك على تحويلها إلى خطوط OpenType القياسية. قم بسحب ملفات الخطوط إلى القائمة أدناه ثم انقر زر التحويل.

source: Install FontForge
ar: تثبيت محرر الخطوط FontForge

source: FontForge is installed
ar: محرر الخطوط FontForge مثبت

source: FontForge is a font editing tool
ar: بوتقة الخطوط FontForge هو أداة لتحرير الخطوط

source: Converting ...
ar: يجري التحويل ...

source: Done
ar: تم.

source: Skipped
ar: متخطاة

source: Not started
ar: لم نبدأ بعد

source: Files
ar: الملفات

source: A Live System enables you to carry your operating system with you. Also, You may add persistent layer so that it can hold your modification to the system.
ar: يُمكنك النظام الحي من أن تحمل نظام التشغيل معك. كما يمكنك إضافة طبقة غير فاقدة تمكنك من حفظ التعديلات على النظام.

source: Source:
ar: المصدر:

source: from iso file
ar: من ملف iso

source: Choose live iso file
ar: اختر ملف iso حي

source: from CD/DVD device
ar: من قرص CD أو DVD

source: Target Device:
ar: الجهاز الهدف

source: Target Options:
ar: خيارات الهدف:

source: Format target partition
ar: تهيئة القسم الهدف

source: uncheck this button to preserve data on target device
ar: تأكد من إزالة هذا الخيار للحفاظ على بياناتك الموجودة على الهدف

source: Reset MBR
ar: إعادة ضبط MBR

source: Overlay size:
ar: حجم الطبقة:

source: size of persistent overlay in MB, 0 to disable
ar: حجم الطبقة غير الفاقدة بوحدة م.ب. صفر لتعطيلها

source: MB
ar: م.ب

source: This will take some time.
ar: سيأخذ هذا بعض الوقت

source: The package 'livecd-tools' is not installed.
ar: الحزمة livecd-tools غير مثبتة

source: Would you like to install 'livecd-tools'?
ar: هل ترغب بتثبيت livecd-tools?

source: Please try again.
ar: فضلا أعد المحاولة...

source: Please choose valid target device.
ar: فضلا اختر جهاز هدف صالح.

source: Are you sure you want to format target device (labeled %s)?
ar: هل انت متأكد أنك ترغب في تهيئة الجهاز الهدف (يحمل العنوان %s)؟

source: Please choose a valid iso file
ar: فضلا، اختر ملف iso صالح

source: Please choose a source device.
ar: فضلا اختر الجهاز المصدر.

source: An error occurred while creating the live system. You may run the following command in terminal to see the error: %s
ar: حدث خطأ أثناء إنشاء القرص الحى يمكنك استخدام هذا الأمر فى الطرفية لمعرفة الخطأ: %s

source: Local repository:
ar: مستودع محلى

source: Ojuba can create local rpository for you!
ar: يمكن لأعجوبة إنشاء مسستودع محلى لحزمك

source: Change directory
ar: تغيير الدليل

source: Repository directory:
ar: دليل المستودع

source: Create local repository
ar: إنشاء مستودع محلى

source: Remove local repository
ar: إزالة المستودع المحلى

source: Select repository directory frist!
ar: إختر دليل الحزم أولاً

source: Dialup modem
ar: مودم الطلب الهاتفي

source: Some software dialup modems are supported by slmodem driver. If you have a supported modem select a proper interface for it and activate its daemon before using it.
ar: يدعم تعريف slmodem بعض مودمات الطلب الهاتفي البرمجية. إن كان مودمك مدعوما اختر واجهة مناسبة وفعّل التعريف قبل استعماله.

source: Install slmodem driver
ar: تثبيت تعريف slmodem

source: slmodem driver is installed
ar: تعريف slmodem مثبت مسبقا

source: driver for some software modems
ar: تعريف لعدد من المودمات البرمجية

source: Start slmodem daemon on boot
ar: تشغيل تعريف slmodem عند الإقلاع

source: Advanced Network settings:
ar: إعدادات متقدمة للشبكة:

source: Firewall protects your system by filtering unwanted network access.
ar: جدار النار يحمي النظام من خلال تصفية/فلترة الوصول غير المرغوب به.

source: Configure firewall
ar: إعداد جدار النار

source: Samba is used to share folders and printers in LAN
ar: تستخدم سامبا لمشاركة المجلدات والطابعات في الشبكة المحلية LAN

source: Start samba on boot
ar: تشغيل سامبا عند الإقلاع

source: Create or modify shares
ar: إنشاء وتعديل المشاركات

source: Allow unprivileged users to create shares
ar: السماح بالمشاركة من مستخدمين دون صلاحيات

source: Network settings:
ar: إعدادات الشبكة:

source: Network Manager applet is the little icon you see on your system tray. You can use it to edit your connections.
ar: بريمج مدير الشبكة هو الأيقونة الصغيرة التي تراها في صنية النظام (قرب الساعة). تستطيع استخدامه لتحرير الاتصالات.

source: Connection Editor
ar: محرر الاتصالات

source: The legacy Network Configuration tool can give you more detailed privileged control over your network. If you have used it please click "Suggest" button
ar: أداة إعداد الشبكة القديمة قد تعطيك صلاحيات مفصلة أكثر في التحكم بالشبكة. لكن إن استخدمته فضلا انقر على زر "النصيحة"

source: Network Configuration
ar: إعداد الشبكة

source: Suggest
ar: نصيحة

source: The device [%s] named [%s] is not set to be started automatically on each boot. Do you like to start it automatically on boot?
ar: الجهاز [%s] المسمى [%s] غير مُعد حاليا كي يبدأ تلقائيا عند تشغيل الجهاز. هل ترغب في إعداده كي يعمل تلقائيا عند إقلاع الجهاز؟

source: The device [%s] named [%s] is not set to be controlled with Network Manager. Do you like to allow Network Manager to control this device?
ar: الجهاز [%s] المسمى [%s] غير مُعد كي يتم التحكم به عبر مدير الشبكة. هل ترغب بالسماح لمدير الشبكة بالتحكم به؟

source: The device [%s] named [%s] is not allowed to be controlled by unprivileged users. Do you like to allow them?
ar: الجهاز [%s] المسمى [%s] محظور التحكم به من قبل المستخدمين دون صلاحيات. هل ترغب بالسماح لهم بالتحكم به؟

source: Network Manager is used by some device, but you are using the legacy network service. Would you like to fix that?
ar: بعض الأجهزة تستخدم مدير الشبكة، لكنك تستخدم خدمة الشبكة القديمة. هل ترغب بإصلاح هذا؟

source: We got no more suggestions. If you have made any changes it will take effect on next boot
ar: لم يعد هناك أي نصائح. إن قمت بأي تغييرات فإنها قد تحتاج إلى إعادة تشغيل الجهاز كي تُفعّل.

source: Old RPM Files:
ar: حزم RPM القديمة

source: Ojuba keeps an archive of all the RPM packages downloaded from the internet Allowing you to use them when necessary However, These packages take precious hard disk space. You can save some space by deleting those files. You can also have a backup which you can use later
ar: تتيح أعجوبة خاصية حفظ الحزم المحملة من الإنترنت ؛ لاستخدامها عند الحاجة بينما تحتل هذه الحزم مساحة كبيرة من القرص يمكنك توفير بعض المساحة الخالية بحذف هذه الملفات كما يمكنك أخذ نسخة احتياطية لإستخدامها لاحقاً

source: Remove old RPM files
ar: حذف الحزم القديمة

source: Backup new RPM files
ar: نسخ الحزم احتياطياً

source: There are no repeated RPM files!
ar: لم يتم العثور على أى حزم مكررة !

source: Delete %d RPM Files, will save %s! Are you sure?
ar: حذف %d ملفات RPM ، سيم تحرير %s هل أنت متأكد ؟

source: %d RPM files has been deleted, TO save %s!
ar: تم حذف %d ملفات RPM, تم تحرير %s!

source: We can't complete this action at this time, due unknown error, you can try again!
ar: لا يمكن إتمام العملية الآن ، بسبب خطأ غير معروف يمكنك المحاولة لاحقاً

source: %d RPM files has been copied To:%s %d Repeated RPMS removed!
ar: تم نسخ %d ملفات RPM إلى :%s وتم حذف %d حزم مكررة!

source: Installed systems:
ar: الأنظمة المثبتة

source: This section will help you to search your disks for installed system and add them to grub menu
ar: هذا القسم يساعدك على البحث فى الأقراص الموصولة عن أنظمة تشغيل أخرى ويضيفها لك في قائمة محمل الإقلاع grub.

source: Install os prober
ar: تثبيت os prober

source: os prober is installed
ar: os prober مثبت مسبقا

source: package detects other OSes available on a system
ar: حزمة تستكشف الأنظمة الأخرى المثبتة فى جهازك

source: Find and add installed systems to grub menu
ar: البحث عن أنظمة مثبتة وإضافتها للقائمة.

source: Are you sure you want to detect and add other operating systems?
ar: هل أنت متأكد من رغبتك في الكشف وإضافة الأنظمة الأخرى.

source: Operating systems found: %s
ar: الأنظمة التي وجدناها هي: %s

source: Package Manager:
ar: مدير الحزم:

source: Package Manager allows you to install software. It saves you the effort downloading, tracing versions and resolving dependencies.
ar: مدير الحزم يُمكنك من تثبيت البرمجيات. إنه يوفر عليك جهد التنزيل وتتبع الإصدارات وحلحلت الاعتماديات.

source: Add/Remove applications
ar: إضافة وإزالة التطبيقات

source: Yum Extender
ar: يم المتقدم

source: Package Manager uses predefined software sources (called repositories) to get software. By using official repositories you will get signed packages.
ar: يستخدم مدير الحزم مصادر معرفة مسبقا للحصول على البرمجيات تسمى مستودعات. إن كنت تستخدم المستودعات الرسمية فإنك ستحصل على حزم ممهورة بتواقيع إلكترونية.

source: Software Sources Editor
ar: محرر مصادر البرمجيات

source: You may add installation medium (CD/DVD) which contains packages. They are used to install packages offline or save bandwidth. Some people consider inserting media annoying and prefer to download packages over the internet.
ar: يمكنك إضافة وسائط التثبيت CD/DVD التي تحتوي على الحزم. فهي تستخدم لتثبيت دون اتصال بالإنترنت أو لتوفير استهلاك الشبكة. بعض الناس يعتبر إدخال الوسيط عند التثبيت أمر مزعج ويفضلون تنزيل الحزم عبر الإنترنت.

source: Add a media repository
ar: إضافة وسيط كمستودع

source: Disable all media repositories
ar: إزالة كل مستودعات الوسائط

source: If you don't have internet access you may want to disable internet repositories.
ar: إن لم تملك اتصال بالإنترنت فإنك قد ترغب في تعطيل مستودعات الإنترنت.

source: Disable all internet repositories
ar: تعطيل كل مستودعات الإنترنت

source: Restore enabled repositories
ar: استعادة المستودعات المفعّلة سابقا

source: Restore the enabled repositories as they were before disabling internet repositories
ar: استعادة المستودعات التي كانت مفعلة كما كانت قبل تعطيل مستودعات الإنترنت

source: You may keep the downloaded packages to pass them to other people. Those packages are kept under /var/cache/yum
ar: يُمكنك الاحتفاظ بالحزم المثبتة كي تمررها للآخرين. يتم الاحتفاظ بتلك الحزم في /var/cache/yum/

source: keep downloaded packages
ar: الاحتفاظ بالحزم بعد تنزيلها

source: Please make sure the media you want to add is inserted before you add it. Do you want to continue?
ar: فضلا تأكد من أن الوسيط الذي تريد إضافته مُدخل قبل أن تتابع. هل ترغب بالمتابعة؟

source: No valid media were found.
ar: لم أجد أي وسيط صالح.

source: Done. %s repositories were added. Open the package manager to load or refresh cache.
ar: تم إضافة %s مستودع. افتح مدير الحزم وحمّل الخبيئة أو حدثها.

source: Done. %s repositories were disabled.
ar: تم تعطيل %s مستودعا.

source: no repository was disabled
ar: لم يتم تعطيل أي مستودع

source: Done. %d repositories were disabled
ar: تم تعطيل %d مستودعا.

source: no repository was enabled
ar: لم يتم تفعيل أي مستودع

source: Done. %d repositories were enabled
ar: تم تفعيل %d مستودعا.

source: Printer settings and tools
ar: إعدادات الطابعة وأدواتها

source: Configure printers
ar: إعداد الطابعات

source: Install support for non-standard printers (GDI or winprinters)
ar: تثبيت دعم للطابعات غير القياسية (طابعات GDI أو winprinters)

source: extra packages are already installed
ar: الحزم الإضافية مثبتة مسبقا

source: Install foo2* packages
ar: تثبيت حزم foo2

source: Samples icon:
ar: أيقونة العينات:

source: ojuba is shipped with samples. You may find an icon to samples on your desktop.
ar: تأتي أعجوبة بعينة من الملفات. تستطيع أن ترى أيقونة العينات على سطح المكتب.

source: Remove samples icon
ar: إزالة أيقونة العينات

source: Recreate samples icon
ar: إعادة إنشاء أيقونة العينات
